Repository: keyx7/ABMT
Catalog: Strings.*.resx
Languages: ru

source: Connected Device:
ru: Подключенное устройство:

# SelectAction
source: Select an action:
ru: Выберите действие:

# Backup
source: 1. Backup
ru: 1. Резервное копирование

# Restore
source: 2. Restore from Backup
ru: 2. Восстановление из резервной копии

# WI-Fi Connect
source: 3. Connect via Wi-Fi
ru: 3. Подключиться по Wi-Fi

# Exit
source: 0. Exit
ru: 0. Выход

# IncorrectSelection
source: Incorrect selection. Press any key to reselect.
ru: Некорректный выбор. Нажмите любую клавишу для повторного выбора.

# ConnectionStatus.status
source: No connected device
ru: Нет подключенного устройства

# ConnectionStatus.Wifi
source: Connected via Wi-Fi
ru: Подключено через Wi-Fi

# ConnectionStatus.USB
source: Connected via USB
ru: Подключено через USB

# ConnectionStatus.State
source: The current status of the connection:
ru: Текущее состояние подключения:

# ConnectToDeviceOverWifi.StartMSG
source: To connect via Wi-Fi you need to turn it on and go to (Debug via Wi-Fi -> Connect device with connection code) and enter the data from there
ru: Для подключения по Wi-Fi вам нужно включить её и перейти в (Отладка по Wi-Fi -> Подключить устройство с помощью кода подключения) и ввести данные от туда

# ConnectToDeviceOverWifi.EnterIP
source: Enter the IP address of the device (e.g. 192.168.1.2):
ru: Введите IP-адрес устройства (например, 192.168.1.2):

# ConnectToDeviceOverWifi.EnterPORT
source: Enter the port:
ru: Введите порт:

# ConnectToDeviceOverWifi.EnterCODE
source: Enter the Wi-fi network connection code:
ru: Введите код подключения по сети Wi-fi:

# ConnectToDeviceOverWifi.Connected
source: The device is connected via Wi-Fi.
ru: Устройство подключено по Wi-Fi.

# ConnectToDeviceOverWifi.ConnectERROR
source: Wi-Fi connection error.
ru: Ошибка подключения по Wi-Fi.

# ConnectToDeviceOverWifi.EmptyIP
source: The IP address cannot be blank.
ru: IP-адрес не может быть пустым.

# ConnectToDeviceOverWifi.PressAnyKey
source: Press any key to return to the main menu.
ru: Нажмите любую клавишу для возврата в главное меню.

# Back
source: Return to main menu (9)
ru: Вернуться в главное меню (9)

# StartBackup
source: Start backup (1)
ru: Начать резервное копирование (1)

# BackupMenu
source: Backup
ru: Резервное копирование

# StartRestore
source: Restore from backup (1)
ru: Восстановить из резервной копии (1)

# RestoreMenu
source: Restore from backup
ru: Восстановление из резервной копии

# BackupMedia.Start
source: Backup Startup...
ru: Запуск резервного копирования...

source: ADB Error:
ru: Ошибка ADB:

# BackupMedia.TotalFiles
source: Total number of files:
ru: Общее количество файлов:

# BackupMedia.Android/data Count
source: The number of files in Android/data/:
ru: Количество файлов в Android/data/:

# BackupMedia.TotalFileSize
source: The total size of the files found:
ru: Общий размер найденных файлов:

# BackupMedia.Photo
source: 1. Photo
ru: 1. Фото

# BackupMedia.Video
source: 2. Video
ru: 2. Видео

# BackupMedia.Audio
source: 3. Audio
ru: 3. Аудио

# BackupMedia.Documents
source: 4. Documents
ru: 4. Документы

# BackupMedia.Conventional
source: conventional
ru: обычных

# BackupMedia.Hidden
source: hidden
ru: скрытых

# BackupMedia.In android/data
source: in Android/data/
ru: в Android/data/

# BackupMedia.EnterNumb
source: Enter the numbers of the file types, separated by a space, that you want to save (e.g. 1 2 for photos and videos):
ru: Введите номера типов файлов через пробел, которые вы хотите сохранить (например, 1 2 для фото и видео):

# BackupMedia.PressH
source: Type 'H' to include hidden files in the backup.
ru: Введите 'H', чтобы включить скрытые файлы в резервное копирование.

# BackupMedia.PressD
source: Type 'D' to include files from android/data/ in the backup.
ru: Введите 'D', чтобы включить файлы из Android/data/ в резервное копирование.

# BackupMedia.IncorrectSelect
source: Incorrect selection. Backup canceled.
ru: Некорректный выбор. Резервное копирование отменено.

# BackupMedia.Copied
source: copied
ru: скопировано

# BackupMedia.CopyError
source: Error when copying a file:
ru: Ошибка при копировании файла:

# BackupMedia.BackupArchive
source: I'm creating a backup archive.
ru: Создаю архив бекапа.

# BackupMedia.BackupCreated
source: The backup has been successfully created:
ru: Резервная копия успешно создана:

# BackupMedia.Size
source: Backup Size:
ru: Размер резервной копии:

# RestoreMedia.SelectRestoreFile
source: Select the file to restore:
ru: Выберите файл для восстановления:

# RestoreMedia.FileNotSelected
source: File not found or not selected.
ru: Файл не найден или не выбран.

# RestoreMedia.MetadataNotFind
source: Metadata file could not be found. Restoration is not possible.
ru: Файл метаданных не найден. Восстановление невозможно.

# RestoreMedia.ReadingError
source: Error reading the metadata file.
ru: Ошибка при чтении файла метаданных.

# RestoreMedia.SelectRestoreFiles
source: Enter the numbers of the file types, separated by a space, that you want to recover (for example, 1 2 for photos and videos):
ru: Введите номера типов файлов через пробел, которые вы хотите восстановить (например, 1 2 для фото и видео):

# RestoreMedia.IncorrectSelection
source: Incorrect selection. Restore canceled.
ru: Некорректный выбор. Восстановление отменено.

source: restored.
ru: восстановлено.

# RestoreMedia.ErrorRestoring
source: Error while restoring a file:
ru: Ошибка при восстановлении файла:

# RestoreMedia.RestoreDone
source: Restoration is complete.
ru: Восстановление завершено.

# FolderNotFind
source: Backup folder not found.
ru: Папка с бэкапами не найдена.

# NoAvailableBackups
source: There are no available backups to restore.
ru: Нет доступных бэкапов для восстановления.

# SelectFileNumb
source: Enter the file number of the file to be recovered:
ru: Введите номер файла для восстановления:

# Copy
source: Copying:
ru: Копирование:

source: Files
ru: Файлов

source: Archiving:
ru: Архивация:

# ConnectDevice
source: Connect your device.
ru: Подключите ваше устройство.

# PressC
source: Or type 'C' to continue without the device.
ru: Или введите 'C' для продолжения без устройства.
